//
//  experimental.c
//  alis
//
//  Created by Vadim Kindl on 12.01.2023.
//  Copyright © 2023 Zlot. All rights reserved.
//

#include "experimental.h"

#include <stdbool.h>

#include "alis.h"
#include "alis_private.h"

#include "utils.h"

// NOTE: Mostly cut and paste code from ghidra I'm trying to make sense at the moment

#ifndef max
#define max(a,b)            (((a) > (b)) ? (a) : (b))
#endif

#ifndef min
#define min(a,b)            (((a) < (b)) ? (a) : (b))
#endif

#define BASEMNMEM_PTR alis.spritemem + basemain
#define SPRITEMEM_PTR alis.spritemem + basesprite

#define SPRITE_VAR(x) ((SpriteVariables *)(SPRITEMEM_PTR + x))
#define SCENE_VAR(x) ((SceneVariables *)(BASEMNMEM_PTR + x))

#define DBTRACE(f, ...) printf("%s " f, __FUNCTION__,  ## __VA_ARGS__); // __PRETTY_FUNCTION__
//#define ELEM_TRACE(x, ...)
#define ELEM_TRACE(x, ...) DBTRACE(x,  ## __VA_ARGS__)
#define LINK_TRACE(x, ...) DBTRACE(x,  ## __VA_ARGS__)
#define CLIP_TRACE(x, ...) DBTRACE(x,  ## __VA_ARGS__)
#define DRAW_TRACE(x, ...) DBTRACE(x,  ## __VA_ARGS__)
#define DEBUGFCE
// #define DEBUGFCE DBTRACE("\n")
#define ELEMIDX(x) ((((x - 0x78) / 0x30) * 0x28) + 0x8078) // return comparable number to what we see in ST debugger
#define VERIFYINTEGRITY
// #define VERIFYINTEGRITY verifyintegrity()

u8 tvmode = 0;
u8 flagmain = 0;

u8 tpalet[1024];
u8 mpalet[1024];
u8 dpalet[1024];

u8 *atpalet = tpalet;
u8 *ampalet = mpalet;
u8 *dkpalet = 0;

u8 palc = 0;
// u8 pald = 0;
u8 palt = 0;
u8 palt0 = 0;
u8 ftopal = 0;
u8 fdarkpal = 0;
u8 thepalet = 0;
u8 defpalet = 0;

u16 *ptabfen = 0;
u8 tabfen = 0;
u8 *ptrent = 0;
u8 tablent = 0;


s32 bufrvb;

u8 numelem = 0;

u8 flaginvx = 0;
u8 fmuldes = 0;
u8 fadddes = 0;

s32 atent;
s32 debent;
s32 finent;
s32 maxent;
s16 nbent;
s16 dernent;

s32 basemain;
s32 basesprite;
u16 libsprit;
s32 debsprit;
s32 finsprit;
s32 backsprite;
s32 tvsprite;
s32 texsprite;
s32 atexsprite;
s32 mousprite;
s32 mousflag;

u16 depx = 0;
u16 depy = 0;
u16 depz = 0;

s32 oldcx;
s32 oldcy;
s32 oldcz;

s32 oldacx;
s32 oldacy;
s32 oldacz;

u8 priorson;
u8 typeson;
u16 longson;
u16 freqson;
u16 dfreqson;
u8 volson;
u16 dvolson;
u16 pereson;

s8 nmode = 0;
s8 falcon = 0;
s8 a1200 = 0;
s8 amiga = 0;
s8 atari = 0;
s8 fsound = 1;
s8 fmusic = 1;

s8 *sd7 = 0;
s8 *sd6 = 0;
s8 *oldsd7 = 0;
s8 *bsd7bis = 0;

s8 bsd7[256];
s8 bsd6[256];

s8 *savsp = 0;
u32 command = 0;
u32 debram = 0;
u32 finram = 0;
u32 savessp = 0;

u32 bufpack = 0x20a00;
u32 mworkbuff = 0x20a00;
u32 adtmono = 0x33700;
u32 finnoyau = 0x33900;
u32 basemem = 0x33900;
u32 basevar = 0;
u32 ophysic = 0x33900;

u16 nbprog = 0;
u8 fswitch = 0;
u8 timing = 0;
u16 ptscreen = 0;
u16 vprotect = 0;
s8 fmouse = 0xff;
u16 fonum = 0xffff;
u8 sback = 0;
u32 debprog = 0;

u32 finprog;
u32 dernprog;

u16 maxprog;

s32 ferase = 0;

u32 newad;
s16 newx;
s16 newy;
s16 newd;
s16 newf;
s16 newh;
s16 newl;
s16 newzoomx;
s16 newzoomy;
s16 blocx1;
s16 blocy1;
s16 blocx2;
s16 blocy2;
u8 joints;
s16 fenx1;
s16 feny1;
s16 fenx2;
s16 feny2;
s16 fenlargw;
u8* adfenintv;
u8 sback;
u8 wback;
u8 cback;
u8 pback;
u16 backprof;
s16 clipx1;
s16 clipy1;
s16 clipx2;
s16 clipy2;
s16 clipl;
s16 cliph;
u8 fclip;

u8 *physic;
// u8 *logic;
u8 logic[320*200];
u8  fphysic = 0;
u8  fphytolog = 0;
u8  fremouse = 0;
u8  fremap = 0;
u8  fremouse2 = 0;
u8  vtiming = 0;
s16 savmouse[2];
u32 savmouse2[8];
u8  switchgo;
u16 backlarg;
u8 *wlogic;
s16 wlogx1;
s16 wlogx2;
s16 wlogy1;
s16 wlogy2;
u16 wloglarg;
s32 logx1 = 0;          // originx 0x0
s32 logx2 = 0x13f; // 0x013f00c7; // dimensions 319x199
s16 logy1 = 0;
s16 logy2 = 0xc7;
u16 loglarg = 0xa0; // 0x50 for st
u8 insid;
u8  spag = 0;
u8  wpag = 0;
u8 *backmap;
s32 backx1;
s32 backx2;
s16 backy1;
s16 backy2;

// to be consistent with old code
#pragma pack(1)

typedef union {
    
    struct {
        
        u8 state;
        u8 numelem;
        u16 screen_id;
        u16 to_next;
        u16 link;
        u32 newad:24;
        u8 newf:8;
        s16 newx;
        s16 newy;
        s16 newd;
        u32 data:24;
        u8 flaginvx:8;
        s16 depx;
        s16 depy;
        s16 depz;
        u8 credon_off;
        u8 creducing;
        u16 clinking;
        u8 cordspr;
        u8 chsprite;
        u16 cnoise;
        u32 sprite_0x28;
        u16 width;
        u16 height;
        u16 newzoomx;
        u16 newzoomy;
    };
    
    u8 variables[0x30];
    
} SpriteVariables;

typedef union {
    
    struct {
        
        u8 state;               // 0x0
        u8 numelem;             // 0x1
        u16 screen_id;          // 0x2
        u16 to_next;            // 0x4
        u16 link;               // 0x6
        u16 unknown0x08;        // 0x8
        u16 unknown0x0a;        // 0xa
        u16 unknown0x0c;        // 0xc
        s16 newx;               // 0xe
        s16 newy;               // 0x10
        u16 width;              // 0x12
        u16 height;             // 0x14
        u16 depx;               // 0x16
        u16 depy;               // 0x18
        u16 depz;               // 0x1a
        u8 credon_off;          // 0x1c
        u8 creducing;           // 0x1d
        u16 clinking;           // 0x1e

        u8 unknown0x20;
        u8 unknown0x21;
        u8 unknown0x22;
        u8 unknown0x23;
        u8 unknown0x24;
        u8 unknown0x25;
        
        u8 unknown0x26;
        u8 unknown0x27;
        u8 unknown0x28;

        u8 unknown0x29;

        u16 unknown0x2a;
        u16 unknown0x2c;
        u16 unknown0x2e;
    };
    
    u8 variables[0x30];
    
} SceneVariables;

#pragma pack(0)

//typedef enum {
//
//    sprite_state                        = 0x00,
//    sprite_numelem                      = 0x01,
//    sprite_screen_id                    = 0x02,
//    sprite_to_next                      = 0x04,
//    sprite_link                         = 0x06,
//    sprite_newad                        = 0x08,
//    sprite_newf                         = 0x08 + 3,
//    sprite_newx                         = 0x0c,
//    sprite_newy                         = 0x0e,
//    sprite_newd                         = 0x10,
